# 游戏界面配置
WIDTH, HEIGHT = 500, 600
TILE_SIZE = 100
GAP = 15
BOARD_OFFSET_Y = 100

# 2048 配色方案
COLORS = {
    0: (205, 193, 180),
    2: (238, 228, 218),
    4: (237, 224, 200),
    8: (242, 177, 121),
    16: (245, 149, 99),
    32: (246, 124, 95),
    64: (246, 94, 59),
    128: (237, 207, 114),
    256: (237, 204, 97),
    512: (237, 200, 80),
    1024: (237, 197, 63),
    2048: (237, 194, 46),
    "bg": (187, 173, 160),
    "text_dark": (119, 110, 101),
    "text_light": (249, 246, 242),
}

# AI 启发式权重
LOST_PENALTY = 200000.0
MONOTONICITY_WEIGHT = 47.0  # 保持行列单调性
SUM_WEIGHT = 11.0  # 防止高价值方块不合并
# MERGES_WEIGHT = 700.0
EMPTY_WEIGHT = 270.0  # 空格奖励
EMPTY_ROW_PENALTY = 10000000.0  # 灭顶之灾
NOT_IN_CORNER_PENALTY = 20000
DEPTH = 4
